xml/request/cancelOrder.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://oss.dbc.dk/ns/openuserstatus">
   <soapenv:Header/>
   <soapenv:Body>
      <open:cancelOrderRequest>
         <open:userId>0406581055</open:userId>
         <!--Optional:-->
         <open:userPincode>1055</open:userPincode>
         <open:agencyId>DK-100450</open:agencyId>
         <!--1 or more repetitions:-->
         <open:cancelOrder>
            <open:orderId>?</open:orderId>
            <open:orderType>?</open:orderType>
         </open:cancelOrder>
      </open:cancelOrderRequest>
   </soapenv:Body>
</soapenv:Envelope>
